MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/atdf/PIC32MX564F128H.atdf
      <value-group caption="Positive Input Select bits for Sample A Multiplexer Setting" name="AD1CHS__CH0SA">
         <value caption="Channel 0 positive input is AN15" name="AN15" value="0xf" />
         <value caption="Channel 0 positive input is AN14" name="AN14" value="0xe" />
         <value caption="Channel 0 positive input is AN13" name="AN13" value="0xd" />
         <value caption="Channel 0 positive input is AN12" name="AN12" value="0xc" />
         <value caption="Channel 0 positive input is AN11" name="AN11" value="0xb" />
         <value caption="Channel 0 positive input is AN10" name="AN10" value="0xa" />
         <value caption="Channel 0 positive input is AN9" name="AN9" value="0x9" />
         <value caption="Channel 0 positive input is AN8" name="AN8" value="0x8" />
         <value caption="Channel 0 positive input is AN7" name="AN7" value="0x7" />
         <value caption="Channel 0 positive input is AN6" name="AN6" value="0x6" />
         <value caption="Channel 0 positive input is AN5" name="AN5" value="0x5" />
         <value caption="Channel 0 positive input is AN4" name="AN4" value="0x4" />
         <value caption="Channel 0 positive input is AN3" name="AN3" value="0x3" />
         <value caption="Channel 0 positive input is AN2" name="AN2" value="0x2" />
         <value caption="Channel 0 positive input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 positive input is AN0" name="AN0" value="0x0" />
      </value-group>
      <value-group caption="Negative Input Select bit for Sample A Multiplexer Setting" name="AD1CHS__CH0NA">
         <value caption="Channel 0 negative input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 negative input is VREFL" name="VREFL" value="0x0" />
      </value-group>
      <value-group caption="Positive Input Select bits for Sample B" name="AD1CHS__CH0SB">
         <value caption="Channel 0 positive input is AN15" name="AN15" value="0xf" />
         <value caption="Channel 0 positive input is AN14" name="AN14" value="0xe" />
         <value caption="Channel 0 positive input is AN13" name="AN13" value="0xd" />
         <value caption="Channel 0 positive input is AN12" name="AN12" value="0xc" />
         <value caption="Channel 0 positive input is AN11" name="AN11" value="0xb" />
         <value caption="Channel 0 positive input is AN10" name="AN10" value="0xa" />
         <value caption="Channel 0 positive input is AN9" name="AN9" value="0x9" />
         <value caption="Channel 0 positive input is AN8" name="AN8" value="0x8" />
         <value caption="Channel 0 positive input is AN7" name="AN7" value="0x7" />
         <value caption="Channel 0 positive input is AN6" name="AN6" value="0x6" />
         <value caption="Channel 0 positive input is AN5" name="AN5" value="0x5" />
         <value caption="Channel 0 positive input is AN4" name="AN4" value="0x4" />
         <value caption="Channel 0 positive input is AN3" name="AN3" value="0x3" />
         <value caption="Channel 0 positive input is AN2" name="AN2" value="0x2" />
         <value caption="Channel 0 positive input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 positive input is AN0" name="AN0" value="0x0" />
      </value-group>
      <value-group caption="Negative Input Select bit for Sample B" name="AD1CHS__CH0NB">
         <value caption="Channel 0 negative input is AN1" name="AN1" value="0x1" />
         <value caption="Channel 0 negative input is VREFL" name="VREFL" value="0x0" />
      </value-group>
      <value-group caption="AN0 Pin Scan Selection bits" name="AD1CSSL__CSSL0">
         <value caption="Select AN0 for input scan; CSSL0 = AN0" name="" value="0x1" />
         <value caption="Skip AN0 for input scan; CSSL0 = AN0" name="" value="0x0" />
      </value-group>
      <value-group caption="AN1 Pin Scan Selection bits" name="AD1CSSL__CSSL1">
         <value caption="Select AN1 for input scan; CSSL1 = AN1" name="" value="0x1" />
         <value caption="Skip AN1 for input scan; CSSL1 = AN1" name="" value="0x0" />
      </value-group>
      <value-group caption="AN2 Pin Scan Selection bits" name="AD1CSSL__CSSL2">
         <value caption="Select AN2 for input scan; CSSL2 = AN2" name="" value="0x1" />
         <value caption="Skip AN2 for input scan; CSSL2 = AN2" name="" value="0x0" />
      </value-group>
      <value-group caption="AN3 Pin Scan Selection bits" name="AD1CSSL__CSSL3">
         <value caption="Select AN3 for input scan; CSSL3 = AN3" name="" value="0x1" />
         <value caption="Skip AN3 for input scan; CSSL3 = AN3" name="" value="0x0" />
      </value-group>
      <value-group caption="AN4 Pin Scan Selection bits" name="AD1CSSL__CSSL4">
         <value caption="Select AN4 for input scan; CSSL4 = AN4" name="" value="0x1" />
         <value caption="Skip AN4 for input scan; CSSL4 = AN4" name="" value="0x0" />
      </value-group>
      <value-group caption="AN5 Pin Scan Selection bits" name="AD1CSSL__CSSL5">
         <value caption="Select AN5 for input scan; CSSL5 = AN5" name="" value="0x1" />
         <value caption="Skip AN5 for input scan; CSSL5 = AN5" name="" value="0x0" />
      </value-group>
      <value-group caption="AN6 Pin Scan Selection bits" name="AD1CSSL__CSSL6">
         <value caption="Select AN6 for input scan; CSSL6 = AN6" name="" value="0x1" />
         <value caption="Skip AN6 for input scan; CSSL6 = AN6" name="" value="0x0" />
      </value-group>
      <value-group caption="AN7 Pin Scan Selection bits" name="AD1CSSL__CSSL7">
         <value caption="Select AN7 for input scan; CSSL7 = AN7" name="" value="0x1" />
         <value caption="Skip AN7 for input scan; CSSL7 = AN7" name="" value="0x0" />
      </value-group>
      <value-group caption="AN8 Pin Scan Selection bits" name="AD1CSSL__CSSL8">
         <value caption="Select AN8 for input scan; CSSL8 = AN8" name="" value="0x1" />
         <value caption="Skip AN8 for input scan; CSSL8 = AN8" name="" value="0x0" />
      </value-group>
      <value-group caption="AN9 Pin Scan Selection bits" name="AD1CSSL__CSSL9">
         <value caption="Select AN9 for input scan; CSSL9 = AN9" name="" value="0x1" />
         <value caption="Skip AN9 for input scan; CSSL9 = AN9" name="" value="0x0" />
      </value-group>
      <value-group caption="AN10 Pin Scan Selection bits" name="AD1CSSL__CSSL10">
         <value caption="Select AN10 for input scan; CSSL10 = AN10" name="" value="0x1" />
         <value caption="Skip AN10 for input scan; CSSL10 = AN10" name="" value="0x0" />
      </value-group>
      <value-group caption="AN11 Pin Scan Selection bits" name="AD1CSSL__CSSL11">
         <value caption="Select AN11 for input scan; CSSL11 = AN11" name="" value="0x1" />
         <value caption="Skip AN11 for input scan; CSSL11 = AN11" name="" value="0x0" />
      </value-group>
